api/app/controllers/admins_controller.rb

    def merchant_admins
        merchant = Merchant.find_by(id: params[:id])
        admins = merchant.admins.all
---
SELECT "admins".* FROM "admins" WHERE "admins"."merchant_id" = $1  [["merchant_id", 1]]