api/app/controllers/admins_controller.rb

SELECT "admins".* FROM "admins"
---
    def index
        # merchant = Merchant.find_by(id: session[:merchant_id])
        admins = Admin.all

SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "admins" ("username", "email", "password_digest", "access", "image", "contact", "address", "merchant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def register
        merchant = Merchant.find(params[:id])
        admin = merchant.admins.create(admin_params)

SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
    def show
        admin = Admin.find_by(id: params[:id])