api/app/controllers/clerks_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "clerks".* FROM "clerks" WHERE "clerks"."admin_id" = $1  [["admin_id", 1]]
---
def all_clerks
    admin = Admin.find_by(id: params[:id])
    if admin
        clerks = admin.clerks.all