api/app/controllers/clerks_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "clerks".* FROM "clerks"
---
def index
    admin = Admin.find_by(id: session[:admin_id])
    clerks = admin.clerks.all

SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "clerks" ("username", "email", "password_digest", "status", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
def add_clerk
    admin = Admin.find_by(id: session[:admin_id])
    if admin
    clerk = admin.clerks.create(clerk_params)

SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
def update
    admin = Admin.find_by(id: session[:admin_id])

SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT "clerks".* FROM "clerks" WHERE "clerks"."admin_id" = $1 AND "clerks"."id" = $2 LIMIT $3  [["admin_id", 1], ["id", 6], ["LIMIT", 1]]
UPDATE "clerks" SET "status" = $1, "updated_at" = $2 WHERE "clerks"."id" = $3  [["status", 1], ["updated_at", "2023-04-18 11:23:30.035815"], ["id", 6]]
---
   def clerk_activation
    admin = Admin.find_by(id: session[:admin_id])
    if admin
        clerk = admin.clerks.find_by(id: params[:id])
        clerk.update(clerk_params[:status])

SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT "clerks".* FROM "clerks" WHERE "clerks"."admin_id" = $1 AND "clerks"."id" = $2 LIMIT $3  [["admin_id", 19], ["id", 19], ["LIMIT", 1]]
---
def show
    admin = Admin.find_by(id: session[:admin_id])
    if admin
        clerk = admin.clerks.find_by(id: params[:id])

SELECT "admins".* FROM "admins" WHERE "admins"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT "clerks".* FROM "clerks" WHERE "clerks"."admin_id" = $1 AND "clerks"."id" = $2 LIMIT $3  [["admin_id", 19], ["id", 19], ["LIMIT", 1]]
---
def destroy
    admin = Admin.find_by(id: session[:admin_id])
    admin.clerks.find(id).destroy