api/app/controllers/merchants_controller.rb

    def index
        merchant = Merchant.all
---
SELECT "merchants".* FROM "merchants"

    def create
        @merchant = Merchant.create(merchant_param)
---
INSERT INTO "merchants" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "kimathi"], ["email", "kimathi@mail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-04-17 08:06:33.593632"], ["updated_at", "2023-04-17 08:06:33.593632"]]

    def show
        merchant = Merchant.find_by(id: params[:merchant_id])
---
SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]