api/app/controllers/products_controller.rb

    def index
        products = Product.all
---
SELECT "products".* FROM "products"

    def add_product
        store = Store.find_by(id: params[:id])

        if store
            product = store.products.create(product_params)
---
SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "products" ("name", "category", "image", "supplier", "buying_price", "selling_price", "store_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"