api/app/controllers/received_items_controller.rb

    def ri_add
        product = Product.find_by(id: params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def payment_status
        product = Product.find_by(id: params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]