api/app/controllers/received_items_controller.rb

SELECT "received_items".* FROM "received_items"
---
    def index
        ri = ReceivedItem.all

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "received_items" ("received", "payment_status", "stocked", "spoilt", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["received", 345], ["payment_status", 0], ["stocked", 564], ["spoilt", 456], ["product_id", 1], ["created_at", "2023-04-18 16:33:14.516009"], ["updated_at", "2023-04-18 16:33:14.516009"]]
---
    def ri_add
        # sql = " product = :name"
        # product = Product.where(sql, {product: product_params[:name]}).first
        product = Product.find_by(id: params[:id])

        if product
            ri = product.received_items.create(ri_params)

UPDATE "received_items" SET "payment_status" = $1, "updated_at" = $2 WHERE "received_items"."id" = $3  [["payment_status", 1], ["updated_at", "2023-04-18 16:41:00.827762"], ["id", 1]]
---
    def update
        ri = ReceivedItem.find_by(id: params[:id])
        if ri
            ri.update(ri_params)

UPDATE "received_items" SET "payment_status" = $1, "updated_at" = $2 WHERE "received_items"."id" = $3  [["payment_status", 1], ["updated_at", "2023-04-18 16:41:00.827762"], ["id", 1]]
---
    def payment_status
        ri = ReceivedItem.find_by(id: params[:id])
        if ri
            ri.update(ri_params)