api/app/controllers/requests_controller.rb

SELECT "requests".* FROM "requests"
---
  def index
    @requests = Request.all

SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_request
      @request = Request.find(params[:id])