api/app/controllers/sessions_controller.rb

SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def login_status

        admin = Admin.find_by(id: session[:admin_id])
        merchant = Merchant.find_by(id: session[:merchant_id])