api/app/controllers/sessions_controller.rb

    def admin_login

        sql = "username = :username OR email = :email "

        admin = Admin.where(sql, {username: admin_params[:username], email: admin_params[:email]}).first
---
SELECT "admins".* FROM "admins" WHERE (username = 'kim' OR email = NULL ) ORDER BY "admins"."id" ASC LIMIT $1  [["LIMIT", 1]]

    def merchant_login

        sql = "username = :username OR email = :email "

        merchant = Merchant.where(sql, {username: merchant_params[:username], email: merchant_params[:email]}).first
---
SELECT "merchants".* FROM "merchants" WHERE (username = NULL OR email = 'kim@mail.com' ) ORDER BY "merchants"."id" ASC LIMIT $1  [["LIMIT", 1]]

    def clerk_login

        sql = "username = :username OR email = :email "

        clerk = Clerk.where(sql, {username: clerk_params[:username], email: clerk_params[:email]}).first
---
SELECT "clerks".* FROM "clerks" WHERE (username = 'base' OR email = NULL ) ORDER BY "clerks"."id" ASC LIMIT $1  [["LIMIT", 1]]

    def clerk_logout
        clerk = Clerk.find_by(id: session[:clerk_id])
---
SELECT "clerks".* FROM "clerks" WHERE "clerks"."id" IS NULL LIMIT $1  [["LIMIT", 1]]

    def admin_logout
        admin = Admin.find_by(id: session[:admin_id] )
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def merchant_logout
        merchant = Merchant.find_by(id: session[:merchant_id])
---
SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" IS NULL LIMIT $1  [["LIMIT", 1]]

    def login_status

        admin = Admin.find_by(id: session[:admin_id])
        merchant = Merchant.find_by(id: session[:merchant_id])
        clerk = Clerk.find_by(id: session[:clerk_id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "clerks".* FROM "clerks" WHERE "clerks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]