api/app/controllers/stores_controller.rb

    def index
        merchant = Merchant.find(session[:merchant_id])
        store = merchant.stores.all
---
SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "stores".* FROM "stores" WHERE "stores"."merchant_id" = $1  [["merchant_id", 1]]

    def add_store
        merchant = Merchant.find_by(id: session[:merchant_id])

        if merchant
            store = merchant.stores.create(store_params)
---
SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "stores" ("name", "address", "location", "merchant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Moringa Store"], ["address", "Ngong Lane plaza"], ["location", nil], ["merchant_id", 1], ["created_at", "2023-04-27 08:53:41.337209"], ["updated_at", "2023-04-27 08:53:41.337209"]]